ErpTest/src/AccumulationRegisters/пкЗаданияНаРемонт/пкЗаданияНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>пкЗаданияНаРемонт</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаданиеНаРемонт</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Enums/пкСтатусыЗаказНарядов/пкСтатусыЗаказНарядов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыЗаказНарядов</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Открыт</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкЗаданиеНаРемонт/пкЗаданиеНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкЗаданиеНаРемонт</name>
  <registerRecords>AccumulationRegister.пкЗаданияНаРемонт</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРемонта</name>
    <type>
      <types>EnumRef.пкМестоРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>пкПрикрепленыФайлыВДО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланируемыеРаботы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/AccumulationRegisters/пкЗаданияНаРемонт/ManagerModule.bsl
Процедура СформироватьЗаписиПоДокументуЗаказНаряд(Отказ, РежимПроведения, тИсточник)
	
	НаборЗаписей  = тИсточник.Движения.пкЗаданияНаРемонт;
	НаборЗаписей.Записывать = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	пкЗаказНарядРаботы.Ссылка КАК Регистратор,
	                      |	пкЗаказНарядРаботы.ЗаданиеНаРемонт,
	                      |	пкЗаказНарядРаботы.ВидРемонта,
	                      |	пкЗаказНарядРаботы.Номенклатура КАК Работа,
	                      |	1 КАК Количество,
	                      |	пкЗаказНарядРаботы.Ссылка.Дата КАК Период,
	                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	                      |ИЗ
	                      |	Документ.пкЗаказНаряд.Работы КАК пкЗаказНарядРаботы
	                      |ГДЕ
	                      |	пкЗаказНарядРаботы.Ссылка = &Ссылка
						  //+++DubI Рарус-СПб 07.04.2017
	                      |	И пкЗаказНарядРаботы.Ссылка.Статус В (Значение(Перечисление.пкСтатусыЗаказНарядов.Выполнен), Значение(Перечисление.пкСтатусыЗаказНарядов.Закрыт))
						  //---DubI Рарус-СПб
	                      |	И пкЗаказНарядРаботы.ЗаданиеНаРемонт <> ЗНАЧЕНИЕ(Документ.пкЗаданиеНаРемонт.ПустаяСсылка)");
	Запрос.УстановитьПараметр("Ссылка",тИсточник.Ссылка);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		НаборЗаписей.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

Процедура СформироватьЗаписиПоДокументуЗаданиеНаРемонт(Отказ, РежимПроведения, тИсточник)
	
	НаборЗаписей  = тИсточник.Движения.пкЗаданияНаРемонт;
	НаборЗаписей.Записывать = Истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	пкЗаданиеНаРемонт.Ссылка КАК Регистратор,
	|	пкЗаданиеНаРемонт.Ссылка КАК ЗаданиеНаРемонт,
	|	пкЗаданиеНаРемонт.Ссылка.Дата КАК Период,
	|	пкЗаданиеНаРемонт.Ссылка.ВидРемонта КАК ВидРемонта,
	|	пкЗаданиеНаРемонт.Работа,
	|	1 КАК Количество,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	Документ.пкЗаданиеНаРемонт.ПланируемыеРаботы КАК пкЗаданиеНаРемонт
	|ГДЕ
	|	пкЗаданиеНаРемонт.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",тИсточник.Ссылка);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		НаборЗаписей.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
Процедура СформироватьЗаписи(Отказ, РежимПроведения, тИсточник) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивИсточников = Новый Массив;
	
	Если ТипЗнч(тИсточник) = Тип("Массив") Тогда
		МассивИсточников = тИсточник;
	Иначе
		МассивИсточников.Добавить(тИсточник);
	КонецЕсли;
	
	Для Каждого ЭлементИсточник из МассивИсточников Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ДокументОбъект.пкЗаказНаряд") Тогда
			СформироватьЗаписиПоДокументуЗаказНаряд(Отказ, РежимПроведения, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ДокументОбъект.пкЗаданиеНаРемонт") Тогда
			СформироватьЗаписиПоДокументуЗаданиеНаРемонт(Отказ, РежимПроведения, ЭлементИсточник);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
